chat_system_1752071102_actor_description=King Mark. Our glorious king.
chat_system_1752071102_start_question=^?^Well... It's probably all for the better. Only time can tell. Maybe you are the man destined to command these creatures.<br>So, our faithful knight. You have already proven that you are ready to serve the crown faithfully. And your talents deserve better use. This time, however, you will have to pass a trial most difficult and dangerous. Do you accept the challenge?
chat_system_1752071102_start_answer_0=^?^Certainly. I also feel that I might do much more than collecting plugens from robbers.
chat_system_1752071102_snap_0_question=^?^We would accept no other answer, [player]!<br>So, Lyaro Island awaits you - and there you will most likely be met by an unknown enemy. If you return victorious, you will be admitted to the most important and secret tasks of the crown.<br>I can already see that I can trust you, but I must be sure you are strong enough to carry out crucial tasks.
chat_system_1752071102_snap_0_answer_0=^?^(Listen further...)
chat_system_1752071102_snap_1_question=^?^We do not know our enemy in this trial, but as a royal Searcher you should not be afraid of the unknown!<br>...Lyaro Island appeared not long ago. First there was a terrible storm and then the new Island appeared in the northern ocean. We sent people there to investigate, but they failed to return. We sent a second expedition, but still there's no news.<br>Go to the island on the dirigible and find out what has happened to our people.<br>And remember, the dirigible will not take you back until you reveal the secret of the island, and eliminate this threat to Darion.
chat_system_1752071102_snap_1_answer_0=^?^Yes, I can see that this is a difficult situation, but I swear here and now that I will bring the matter to conclusion, or my name's not [rank] [player]!
chat_system_1752071102_snap_2_question=^?^It is good to hear these words, [player]. Take 3000 gold coins. You may need them for hiring troops. And visit the Temple of Truth; I think Aron Demion's warriors may be useful in your quest.
chat_system_1752071102_snap_2_answer_0=^?^Thank you, I will set out as soon as I am prepared.
chat_system_1752071102_snap_no_kill_question=^?^Well, well, well, [player], have you already been to Lyaro Island? We anxiously await news about what has happened there. Two lost troops expeditions led us to believe that a great danger inhabits the island, one which may be a serious threat to our blessed Darion.
chat_system_1752071102_snap_no_kill_answer_0=^?^I'd like to know how to get to the island.
chat_system_1752071102_snap_no_kill_answer_1=^?^Yes, I've been to the island.<br>(Tell about what has happened, in detail...)
chat_system_1752071102_snap_3_question=^?^Our technician Tregum will take you to the island on a dirigible! He has already received our instructions. I hope you're not afraid of our little dwarf - or heights? Ha-ha.
chat_system_1752071102_snap_3_answer_0=^?^Thank you, I understand. I will go now to the dirigible.
chat_system_1752071102_snap_4_question=^?^Very, very interesting... So you say you've concluded an alliance with the huge turtle? Well it is certainly good to have a powerful ally; still it was rather unwise to bind us with such ties...<br>The shaman must have wanted to sacrifice the Turtle to Dark Spirits, I should think. That would be a great sacrifice, because as I understand, even a common turtle is a sacred animal, a symbol of wisdom and longevity, and of the universe's basic stability.
chat_system_1752071102_snap_4_answer_0=^?^I don't really know what exactly he wanted...
chat_system_1752071102_snap_5_question=^?^I wish we could reveal this secret fully. We shall place a defensive troop on the island immediately. The island will be declared a restricted zone, and nobody will bother this huge animal without our consent. If the shaman attempts to enter there again, he'll receive a warm welcome.<br>But you will not participate in this matter further, [player]. You have completed your part of the mission, and proven that you are brave indeed. Now I shall assign you a mission connected with high politics.<br>[reward]
chat_system_1752071102_snap_5_answer_0=^?^Politics? But I'm neither a spy nor an assassin.
